---
kind: other
id: Properties.T:Autodesk.Revit.DB.FailureHandlingOptions
source: html/8de0f12d-8b5e-10a1-0628-76043eeabd16.htm
---
# FailureHandlingOptions Properties

Specifies whether the .NET object represents a valid Revit entity.